vinthewrench/Coop2/ESP8266Mgr.cpp
//
//  ESP8266Mgr.cpp
//  ESP8266Mgrtest
//

/*****************************************************************************
 
MIT License

 Copyright (c) 2020 Vinnie Moscaritolo
 
Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*****************************************************************************/

#include "ESP8266Mgr.h"
#include "Utilities.h"

#include <string>
#include <search.h> // for the qsort()
 
#define DEBUG_PROTOCOL 	0
#define DEBUG_STREAM 	 	0

#if DEBUG_STREAM
#define START_TRACE 	trace_stream = true;
#define STOP_TRACE 	trace_stream = false;
#else
#define START_TRACE
#define STOP_TRACE
#endif

const char atAT[]			PROGMEM	= "AT";
const char atRST[]			PROGMEM	= "AT+RST";
const char atGMR[] 			PROGMEM	= "AT+GMR";
const char atATE0[] 		PROGMEM	= "ATE0";
const char atCWMODE[] 		PROGMEM	= "AT+CWMODE_CUR";
const char atCIPMUX[] 		PROGMEM	= "AT+CIPMUX";
const char atCIPDINFO[] 	PROGMEM	= "AT+CIPDINFO";
const char atCWJAP[] 		PROGMEM	= "AT+CWJAP_CUR";
const char atCIFSR[] 		PROGMEM	= "AT+CIFSR";
const char atCWAUTOCONN[]  PROGMEM	= "AT+CWAUTOCONN";
const char atCIPSTATUS[]  PROGMEM	= "AT+CIPSTATUS";
const char atCWQAP[]  		PROGMEM	= "AT+CWQAP";
const char atCWLAP[]  		PROGMEM	= "AT+CWLAP";
const char atCIPSTART[]  		PROGMEM	= "AT+CIPSTART";
const char atCIPSEND[]  		PROGMEM	= "AT+CIPSEND";
const char atCIPCLOSE[]  		PROGMEM	= "AT+CIPCLOSE";
const char atCIPSERVER[]  	PROGMEM	= "AT+CIPSERVER";

void niceDelay(unsigned long duration){
	unsigned long startMillis = millis();
	while(millis() - startMillis < duration){
		sqrt(4700);
	}
}


/*
 AT+RST
 
 AT+CWMODE_CUR=1
 AT+CIPMUX=1
 AT+CWAUTOCONN=0
 AT+CIPDINFO=1
 AT+GMR
 
 // connect UDP ipaddr, portum == > <conn Id>
 AT+CIPSTART=0,"UDP","north-america.pool.ntp.org",123
 == 0,CONNECT
 == OK
 ---------------
 
 send <conn id> bytes
 AT+CIPSEND=0,48
 ==  OK
 == >
 
 1B 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00
 ==>Recv 48 bytes
 
 ==>  SEND OK
 -----------
 +IPD,0,48,163.237.218.19,123:
 2E 2E 2E E7 2E 2E 2E 2E 2E 2E 2E 2E 47 50 53 2E E3 2E D7 89 2E 2E 2E 2E 2E 2E 2E 2E 2E 2E 2E 2E E3 2E D7 89 DB 83 2E 79 E3 2E D7 89 DB 83 6C 75
 -----------
 
 close <conn id>
 
 AT+CIPCLOSE=0
 == 0,CLOSED
 == OK
 
 */


 #if DEBUG_PROTOCOL

static const char* responseTable[] = {
	"INVALID",
	"OK",
	"ERROR",
	"FAIL",
	"WIFI_CONNECTED",
	"WIFI_GOT_IP",
	"DISCONNECT",
	"BUSY_S",
	"BUSY_P",
	"CONNECT",
	"CLOSED",
	"IPD",
	"SEND_OK",
	"SEND_FAIL",
	"STAIP",
	"STAMAC",
	"APIP",
	"APMAC",
	"CWLAP",
	"CJLAP",
	"CIPSTATUS",
	"SEND_DATA",
	"OTHER",
	"READY",
	"CONTINUE",
	"NOTHING"
};
 #endif


#if DEBUG_STREAM
static bool trace_stream = false;
#endif

// MARK: - ESP8266Mgr

ESP8266Mgr::ESP8266Mgr(Stream* wifiSerialIn, uint8_t resetPin ){
	
	_wifiSerial = wifiSerialIn;
	_resetPin 			= resetPin;
	_hasCIFSR 			= false;
	_isConnectedToAP  = false;
	_isSetup 			= false;
	_radioIsPowered 	= false;

	pinMode(_resetPin, OUTPUT);

	_parser.reset();
}
bool ESP8266Mgr::begin(){
	
	if(_isSetup)
		return true;
	
	bool success = false;
	
	STOP_TRACE
		
	_parser.reset();
	success = resetDevice();
	
	if(success){
		success = softReset();
	}
	
	// set echo off
	if(success){
		success = doCmd(atATE0);
	}
	
	// set Wi-Fi mode
	if(success){
		success = doCmd("%s=%d",atCWMODE,1);
	}
	
	// set Enable Multiple Connections
	if(success){
		success = doCmd("%s=%d",atCIPMUX,1);
	}
	
	// disable autoconnect
	if(success){
		success = doCmd("%s=%d",atCWAUTOCONN,0);
	}
	
	// Shows remote IP and remote port with +IPD
	if(success){
		success = doCmd("%s=%d",atCIPDINFO,1);
	}
	
	START_TRACE
	
	_isSetup = success;
	
	return success;
}


bool ESP8266Mgr::resetDevice()
{
	constexpr int HW_RESET_RETRIES  = 3;
 
	//Do a HW reset
	bool statusOk = false;
	
	for(int i =0; i<HW_RESET_RETRIES && !statusOk; i++){
		
		setRadioPower(false);
		niceDelay(500);
		setRadioPower(true);
		
		while(true) {
			wf_resulr_t result = recvResponse(3000);
			if(result == WFR_OTHER) continue;
			if(result == WFR_READY){
				statusOk = true;
			}
			break;
		}
	}
	
	return statusOk;
}


bool ESP8266Mgr::softReset(){
 
	constexpr int SW_RESET_RETRIES  = 3;
	bool statusOk = false;
	
	for(int i =0; i<SW_RESET_RETRIES && !statusOk; i++){
		
		//Do a SW reset
		writeCommand(atRST);
		while(true) {
			wf_resulr_t result = recvResponse(5000);
			
			if(result == WFR_READY){
				statusOk = true;
			}
			else if(result == WFR_OK) continue;
			// lots of noise
			else if(result == WFR_OTHER) continue;
			
			break;
		}
	}
 
	return statusOk;
}


void ESP8266Mgr::setRadioPower(bool state){
	
	digitalWrite(_resetPin, state?HIGH:LOW);
	_radioIsPowered = state;
	
	if(!state){
		_isConnectedToAP = false;
		_hasCIFSR = false;
		
		// zero  out the stuff
	 	bzero(_activeLinks, sizeof(cipStatus_entry) * MAX_WIFI_LINKS );
		bzero(_linkCallbacks,sizeof(connection_func_t) * MAX_WIFI_LINKS );
		bzero(_linkCallbackArgs, sizeof (void*) * MAX_WIFI_LINKS );
		bzero(_udpReplyTimeouts, sizeof(unsigned long) * MAX_WIFI_LINKS );
		bzero(_linksToClose,  sizeof(bool) * MAX_WIFI_LINKS );
		bzero(_newServerConnection,  sizeof(bool) * MAX_WIFI_LINKS );

		ipaddr= String();
		mac = String();
	}
}

void ESP8266Mgr::stop(){
	
