vinthewrench/Coop2/ESP8266Mgr.cpp
	setRadioPower(false);
	_isSetup = false;
	
}


bool ESP8266Mgr::isRunning()
{
	return _isSetup;
}

String ESP8266Mgr::getVersion(){
	
	String str = String();

	STOP_TRACE

	writeCommand(atGMR);
	
	while(true) {
		
		wf_resulr_t result = this->handleResponse(3000, NULL,NULL);

		if(result == WFR_OTHER){
			
			uint8_t* data = NULL;
			if(_parser.get_data( &data, NULL)) {
				
//#if DEBUG_PROTOCOL
//				Serial_Printf(&Serial,"OTHER |%s|\n", (char*) data);
//#endif
				str+= (char*)data;
				str+= " ";
				free(data);
			}
			
		}else {
			break;
		}
	}
	START_TRACE
	

	return str;
}


/*
 failReason
 ‣ 1: connection timeout.
 ‣ 2: wrong password.
 ‣ 3: cannot find the target AP.
 ‣ 4: connection failed.
 */

bool ESP8266Mgr::connectToAP(const char* ssid,
								  const char* password,
								  int* 	failReasonOut){
	bool success = false;
	bool askForCIFSR = false;
	int failReason = 0;
	
 	STOP_TRACE

	_isConnectedToAP = false;
	_hasCIFSR = false;
	// zero  out the linkIDs
	bzero(_activeLinks,  sizeof(cipStatus_entry) * MAX_WIFI_LINKS );
	
	ipaddr= String();
	mac = String();
	
	writeCommand("%s=\"%s\",\"%s\"",atCWJAP ,ssid , password? password:"" );
	
	while(true){
		
		wf_resulr_t result = recvResponse(5000);
		
		if(result == WFR_OK){
			_isConnectedToAP = true;
			success = true;
			break;
		}
		else if(result == WFR_FAIL){
			_isConnectedToAP = false;
			break;
		}
		else if(result == WFR_WIFI_CONNECTED){
			_isConnectedToAP = true;
		}
		else if(result == WFR_DISCONNECT){
			_isConnectedToAP = false;
			success = false;
		}
		else if(result == WFR_CJLAP){
 
			uint8_t* data = NULL;
			if(_parser.get_data( &data, NULL)) {
				//   error reason - not always correct
					int result = sscanf((const char *) data, "%d", &failReason);
				free(data);
			}
			
			_isConnectedToAP = false;
			success = false;
		}
		else if(result == WFR_WIFI_GOT_IP){
			askForCIFSR = true;
		}
		// ignore noise
	}
	
	if(success && askForCIFSR){
		success = getCIFSR();
	}
	
	if(!success){
		if(failReasonOut)
			*failReasonOut = failReason;
	}
	
	START_TRACE

	return success;
	
}


 bool ESP8266Mgr::connectToKnowAP(AP_pwd_entry* knownAPList,
										 size_t knownAPCount,
										 int* 	failReasonOut)
{
	bool success = false;

	STOP_TRACE

	int failReason = 0;
	
	ap_entry* foundAPList = NULL;
	size_t count = 0;
	
	if(this->getAPList(true ,&foundAPList, &count)
		&& (count > 0)) {
		
		for(size_t i = 0; i < knownAPCount; i++){
			AP_pwd_entry en = knownAPList[i];
			
			for(size_t j = 0; j < count; j++){
				ap_entry* ap = &foundAPList[j];
				
				if( strncmp(en.ssid, ap->ssid, 32) == 0){
					
//	Serial_Printf(&Serial, "CONNECT TO |%s|", en.ssid);

					if(this->connectToAP(en.ssid,en.pwd, &failReason))
					{
						success = true;
						goto done;
					}
				}
			}
		}
	}
	
	START_TRACE;
	
	if(foundAPList)
		free(foundAPList);
	
done:
	
	if(!success){
		if(failReasonOut)
			*failReasonOut = failReason;
	}

	return success;
}


bool ESP8266Mgr::disconnectFromAP(){

	STOP_TRACE

	_isConnectedToAP = false;
	_hasCIFSR = false;
		
	ipaddr= String();
	mac = String();
	
	bool success = false;
	
	writeCommand(atCWQAP);
	
	while(true){
		
		wf_resulr_t result = this->handleResponse(1000, NULL, NULL);
	 
		if(result == WFR_OK){
			success = true;
			break;
		}
	}
	
//	//  update the table on next idle  -- it takes some time to disconnect
//	this->updateStatus();

	START_TRACE

	return success;
}

bool ESP8266Mgr::isConnectedToAP() {
	
	return (_isSetup
			  && _radioIsPowered
			  && _isConnectedToAP);
 
	return false;
}

//	 getCurrentAPInfo returns valid  (ssid, mac, channel, rssi) of connected AP

bool ESP8266Mgr::getCurrentAPInfo(ap_entry* apInfoOut){
	
	bool success = false;
	bool statusChange = false;

	STOP_TRACE

	if(!this->isConnectedToAP())
		return false;
	
	ap_entry info;
	bzero(&info, sizeof(ap_entry));
 
	// request Query
	writeCommand("%s?",atCWJAP );

	while(true){
		
		wf_resulr_t result = this->handleResponse(2000, NULL, NULL);
		
		if(result == WFR_OK){
			break;
		}
		if(result == WFR_CJLAP){
			
			uint8_t* data = NULL;
			if(_parser.get_data( &data, NULL)) {
				
				int result = sscanf((const char *) data, "\"%32[^\"]\",\"%17[^\"]\",%d,%d)",
										  info.ssid,
										  info.mac,
										  &info.channel,
										  &info.rssi) ;
				
				success = result == 4;
				free(data);
			}
		}
		else if(result == WFR_OTHER){  // No AP
			//			uint8_t* data = NULL;
			//
			//			if(_parser.get_data( &data, NULL)) {
			//				Serial_Printf(&Serial, "CWJAP REPLY |%s|",data);
			//				free(data);
			//			}
		}
		else {
			// undefined
			break;
		}
		
	}

	if(success){
		if(apInfoOut)
			*apInfoOut = info;
	}
	// update status table.
	if(statusChange){
		this->updateStatus();
	}
 	START_TRACE
 
	return success;
}

void ESP8266Mgr::idleHandler(bool *APChangeOut){

	STOP_TRACE
	
	if(!_isSetup || !_radioIsPowered)
		return;
	
	bool statusChange = false;
	bool APstatusDidChange = false;
	bool askForCIFSR = false;	
	
	// check for serial activity
	if(_wifiSerial->available() > 0){
		
		while(true){
			
			wf_resulr_t result = this->handleResponse(0, &statusChange, &APstatusDidChange);
			
			// what we want is nothing
			if(result == WFR_NOTHING){
				break;
			}
			if(result == WFR_WIFI_GOT_IP){
				askForCIFSR = true;
				continue;
			}
			else {
				// not sure?
//				Serial_Printf(&Serial,"HANDLE RESPONSE %i ?",result);
				break;
			}
		}
	}
	
	if(this->processLazyLinkClose()){
		statusChange = true;
	}
	
	this->processLinkTimeouts();

	// update status table.
	if(statusChange){
		this->updateStatus();
	}

	if(askForCIFSR) {
		getCIFSR();
	}
	
	START_TRACE

	if(APChangeOut)
		*APChangeOut = APstatusDidChange;
}

bool ESP8266Mgr::stopServer(){
	
	// are we al;ready stopped?
		if(serverCallback == NULL)
			return true;

	STOP_TRACE

	bool success = false;

	serverCallback = NULL;
	serverCallbackArg = NULL;
	
	writeCommand("%s=%u",atCIPSERVER, 0 );

	while(true){
		
		wf_resulr_t result = recvResponse(1000);
		
		if(result == WFR_OK){
			success = true;
			break;
		}
		else {
			// ignore noise
//			Serial_Printf(&Serial, "STOP SERVER REPLY  %d",result);
		}

