vinthewrench/Coop2/ESP8266Mgr.cpp
	}
	
	START_TRACE

	return success;
}


bool ESP8266Mgr::startServer(uint16_t portNum,
								  connection_func_t listener, void* arg ){
	bool success = false;
	bool askForCIFSR = false;
	
// are we al;ready started
	if(serverCallback != NULL)
		return true;
	
	serverCallback = listener;
	serverCallbackArg = arg;

	uint8_t link_id = MAX_WIFI_LINKS;
	
	// reap any waiting links.
	this->processLazyLinkClose();

	// select an available linkID
	for(int idx = 0; idx < MAX_WIFI_LINKS; idx++){
		if(_activeLinks[idx].localPortNum == 0 ){
			link_id = idx;
			break;
		}
	}

	// fail if none available
	if(link_id >= MAX_WIFI_LINKS)
		return false;
	
	writeCommand("%s=%u,%u",atCIPSERVER, 1, portNum );

	while(true){
		
		wf_resulr_t result = this->handleResponse(5000, NULL, NULL);
	 
		if(result == WFR_OK){
			success = true;
			break;
		}
		else if(result == WFR_WIFI_GOT_IP){
			askForCIFSR = true;
		}
		else if(result == WFR_OTHER){
			
			uint8_t* other = NULL;
			
			if(_parser.get_data( &other, NULL)) {
			
//				Serial_Printf(&Serial, "START SERVER REPLY: %s",other);
		
	 			free(other);
			}
		}
		else {
			// ignore noise
//			Serial_Printf(&Serial, "START SERVER REPLY  %d",result);
		}

	}
 
	if(askForCIFSR) {
		getCIFSR();
	}
	
	return success;

}


bool ESP8266Mgr::openConnection(bool isTCP, const char* ipaddr, uint16_t portNum,
									  connection_func_t listener, void* arg, uint8_t* link_idOut ){
	bool success = false;
	
	uint8_t link_id = MAX_WIFI_LINKS;
	
	// reap any waiting links.
	this->processLazyLinkClose();
	
	// select an available linkID
	for(int idx = 0; idx < MAX_WIFI_LINKS; idx++){
		if(_activeLinks[idx].localPortNum == 0){
			link_id = idx;
			break;
		}
	}
	
	// fail if none available
	if(link_id >= MAX_WIFI_LINKS)
	{
		Serial_Print(&Serial, "NO LINKS AVAILABLE");
#if DEBUG_PROTOCOL
		dumpLinkTable();
#endif
		return false;
	
	}
	
	writeCommand("%s=%u,\"%s\",\"%s\",%u",atCIPSTART , link_id,
					 isTCP?"TCP":"UDP", ipaddr, portNum );
	
	while(true){
		
		wf_resulr_t result = this->handleResponse(5000, NULL, NULL);

		if(result == WFR_OK){
			success = true;
			break;
		}
		else if(result == WFR_ERROR){
			break;
		}
//		else {
//			Serial_Printf(&Serial,"openConnection response %u %s\n", result, responseTable[result]);
//
//			// ignore noise
//
//		}
		
	}
	
	// update the link table.
	if(success){
		success = this->updateStatus();
	}
	if(success){
		
		_linkCallbacks[link_id] = listener;
		_linkCallbackArgs[link_id] = arg;
 
		if(link_idOut)
			*link_idOut = link_id;
	}
	return success;
}



bool ESP8266Mgr::getConnectionInfo(uint8_t  link_id , cipStatus_entry* info){
	
	// param check
	if(link_id >= MAX_WIFI_LINKS)
		return false;
	
	if(_activeLinks[link_id].localPortNum == 0 ){
		return false;
	}
	
	if(info)
		*info = _activeLinks[link_id];
	
	return true;
}

bool ESP8266Mgr::closeConnection(uint8_t  link_id ){
//	bool success = false;
	
	// param check
	if(link_id >= MAX_WIFI_LINKS)
		return false;
	
	if(_activeLinks[link_id].localPortNum == 0 ){
		return false;
	}
 
// we defer the close to a later time.
	_udpReplyTimeouts[link_id] = 0;
	_linkCallbacks[link_id] = NULL;
	_linkCallbackArgs[link_id] = NULL;
	_linksToClose[link_id] = true;
	_newServerConnection[link_id] = false;
	
	return true;
}

bool ESP8266Mgr::sendData( uint8_t  link_id, const uint8_t* data, size_t dataLen){
	bool success = false;

//	Serial_Printf(&Serial,"sendData");
// 	dumpHex(&Serial,(uint8_t*)data,dataLen,0);

	int recvCount = 0;
	
	// param check
	if(link_id >= MAX_WIFI_LINKS)
		return false;
	
	if(_activeLinks[link_id].localPortNum == 0 ){
		return false;
	}
	
	/* send works like this:
		 -->  AT+CIPSEND=<linkid>,<bytecount>
		 <--  OK
		 <--  "> "
		 --> <data bytes>
		 <--  Recv <bytecount> bytes
		 <--  SEND OK
	 */
	
	writeCommand("%s=%u,%u",atCIPSEND ,link_id, dataLen);

	// wait for ready to send.
	while(true){
//		wf_resulr_t result = recvResponse(500);
		
		wf_resulr_t result = this->handleResponse(1000, NULL, NULL);
	
		if(result == WFR_OK) {
			// ignore for now -- this is the ack of the send commend
		}
		else if(result == WFR_ERROR) {
 		// fail this
			break;
		}
		else if(result == WFR_SEND_DATA)
		{
			// signal to send
			_wifiSerial->write(data, dataLen);
		}
		else if(result == WFR_OTHER){  // expect  "Recv %d bytes"
			
			uint8_t* other = NULL;
			
			if(_parser.get_data( &other, NULL)) {
				sscanf((const char *) other, "Recv %d bytes", &recvCount );
				free(other);
			}
	 		 else {
					
//				 Serial_Printf(&Serial,"sendData Unexpected  |%s|", other);
				 free(other);
			}
		}
		else if(result == WFR_SEND_OK){   // send was OK
			success = true;
			break;
		}
		else
		{
			break;   // anything else is fail..
		}
	}
	
	// check sent bytecount
	if(success) {
		success = ((size_t)recvCount == dataLen);
	}
	
//	Serial_Printf(&Serial,"sendData %s",success?"OK":"Fail");

	return success;
}

bool ESP8266Mgr::sendUDP(uint8_t link_id, uint32_t timeout, const uint8_t* data, size_t dataLen) {
	bool success = false;
	
	success = sendData(link_id,data,dataLen);
	
	if(success) {
		
		unsigned long now = millis();
		_udpReplyTimeouts[link_id] = now + timeout;
	}
	
	return success;
}


// MARK: - ESP8266 API

// get IP address and stuff
bool ESP8266Mgr::getCIFSR(){
	bool success = false;

	STOP_TRACE

	writeCommand(atCIFSR);
	
	while(true){
		
		wf_resulr_t result = recvResponse(3000);
		
		if(result == WFR_OK){
			_hasCIFSR = true;
			success = true;
			break;
		}
		else if(result == WFR_STAIP){
			ipaddr = _parser.get_ipaddr();
		}
		else if(result == WFR_STAMAC){
			
			mac = _parser.get_mac();
			
		}
		else break;
	}

	START_TRACE
	
	return success;
}

#if DEBUG_PROTOCOL

void ESP8266Mgr::dumpLinkTable() {

	for(int idx = 0; idx < MAX_WIFI_LINKS; idx++){

		cipStatus_entry  cpd = _activeLinks[idx];
		Serial_Printf(&Serial, "%u: %c %u %-16s %5d - %5d %s",
						  idx, cpd.isServer == 1?'S':'C',
						  cpd.connType,
						  cpd.ipaddr,
						  cpd.remotePortNum,
						  cpd.localPortNum,
						  _linksToClose[idx]?"CLOSE":""
						  );
	}
}
#endif

bool ESP8266Mgr::processLazyLinkClose(){
 
	if(!_radioIsPowered)
		return false;
	
	bool a_link_was_closed = false;
	
