vinthewrench/Coop2/ESP8266Mgr.cpp
	// check for defeered link close
	for(int idx = 0; idx < MAX_WIFI_LINKS; idx++){
		// perform link close here
		if(_linksToClose[idx]) {
			
			a_link_was_closed = true;
			_linksToClose[idx] = false;
			_udpReplyTimeouts[idx] = 0;
			
//	Serial_Printf(&Serial,"atCIPCLOSE  %u\n", idx);

			writeCommand("%s=%u",atCIPCLOSE , idx);
	
			while(true){
				
				wf_resulr_t result = this->handleResponse(1000, NULL, NULL);
				
				if(result == WFR_OK){
					break;
				}
				else if(result == WFR_CLOSED){
					continue;
				}
				else if(result == WFR_ERROR){
					break;
 				}
				else if(result == WFR_UNLINK){
//					Serial_Printf(&Serial,"UNLINK");
 					continue;
				}
				else if(result == WFR_NOTHING){
//					Serial_Printf(&Serial,"closeConnection WFR_NOTHING");
					break;
				}
	 
				else {
//// DEBUG
	//					Serial_Printf(&Serial,"closeConnection RESPONSE %i ?",result);
			
//			Serial_Printf(&Serial,"closeConnection response %u %s\n", result, responseTable[result]);

					//	everything else is an error
					continue;
				}
			}
		}
	}

 
	return a_link_was_closed;
}

void ESP8266Mgr::processLinkTimeouts(){
	// check for timeouts
	unsigned long now = millis();
	
	for(int idx = 0; idx < MAX_WIFI_LINKS; idx++){
		
		// is it an active UPD connection
		if( (_activeLinks[idx].localPortNum != 0)
			&& (_activeLinks[idx].isServer == 0)
			&& (_activeLinks[idx].connType == CIPC_UDP)
			&& (_udpReplyTimeouts[idx] > 0))
		{
			// did it timeout
			if(_udpReplyTimeouts[idx] < now){
				
				// inform listner of timeout
				if(_linkCallbacks[idx] != NULL) {
					
					(_linkCallbacks[idx])(idx, _linkCallbackArgs[idx],
												 WFCF_TIMEOUT,
												 _activeLinks[idx].ipaddr,
												 _activeLinks[idx].remotePortNum,
												 NULL, 0 );
				}
				_udpReplyTimeouts[idx] = 0;
			}
		}
	}

}


bool ESP8266Mgr::updateStatus(){
	
	bool success = false;
	bool done = false;
	
	bool shouldCLoseLinks = false;

	// 	Serial_Print(&Serial,"updateStatus");
	
	// zero  out the linkIDs
	cipStatus_entry updatedLinks[MAX_WIFI_LINKS];
	bzero(updatedLinks, sizeof(cipStatus_entry) * MAX_WIFI_LINKS );
	
	writeCommand(atCIPSTATUS);
	while(!done){
		
		// we dont care about statusChange ..
		
		wf_resulr_t result = this->handleResponse(1000, NULL, NULL);
		
		// the CIPSTATUS command is done
		if(result == WFR_OK){
			done = true;
			success = true;
			
//			Serial_Print(&Serial,"CIPSTATUS done");

		}
		
		//  +CIPSTATUS:0,"UDP","173.230.154.254",123,6636,0

		else if(result == WFR_CIPSTATUS){
			// update the _activeLinks
			cipStatus_entry  cip;
	 
			if(_parser.get_cipstatus( &cip)) {
				if(cip.linkid < MAX_WIFI_LINKS){
					
					// check for server here..
					if((cip.isServer == true)
						&& (_linkCallbacks[cip.linkid] == NULL) ){
						_linkCallbacks[cip.linkid] = serverCallback;
						_linkCallbackArgs[cip.linkid] = serverCallbackArg;
						
						if(!_newServerConnection[cip.linkid])
							_newServerConnection[cip.linkid] = true;
					}
					updatedLinks[cip.linkid] = cip;
				}
			}
		}
		else if(result == WFR_OTHER){
			uint8_t* data = NULL;
			
			if(_parser.get_data( &data, NULL)) {
				
				int status = -1;
				int result = sscanf((const char *) data, "STATUS:%d", &status  );
								
				if(result == 1){
					
					switch(status){
						case 2:		// The ESP8266 Station is connected to an AP and its IP is obtained.
						case 3:		// The ESP8266 Station has created a TCP or UDP transmission.
						case 4:		//  The TCP or UDP transmission of ESP8266 Station is disconnected.
							_isConnectedToAP = true;
							break;
							
						case 5:		//  The ESP8266 Station does NOT connect to an AP.
							shouldCLoseLinks = true;
							_isConnectedToAP = false;
							break;

						default:
							_isConnectedToAP = false;
					}
				} else {
					
						Serial_Printf(&Serial,"CIPSTATUS found |%s|", data);
				}
				
				free(data);
			}
		}
		else {
			done = true;
		}
	}
	
	// special case - wifi disconnected from AP.
	// wee need to close all connections on device
	
		// update the link table
	memcpy(_activeLinks, updatedLinks, sizeof(cipStatus_entry) * MAX_WIFI_LINKS );

	if(shouldCLoseLinks){
		this->closeAllLinks();
	}
	
	// tell any server callbacks a new connection is made
	for(int idx = 0; idx < MAX_WIFI_LINKS; idx++){
		if(_newServerConnection[idx]) {
			
			(_linkCallbacks[idx])(idx, _linkCallbackArgs[idx],
										 WFCF_OPEN,
										 _activeLinks[idx].ipaddr,
										 _activeLinks[idx].remotePortNum,
										 NULL, 0 );

			_newServerConnection[idx] = false;
		}
	}
	
//	dumpLinkTable();


	return success;
}

void ESP8266Mgr::closeAllLinks(){
	
	// walk the link table
	for(int idx = 0; idx < MAX_WIFI_LINKS; idx++){
		
		// if it's an active link, we need to close it
		if(_activeLinks[idx].localPortNum != 0 ){
			
			// close the link on the device
			writeCommand("%s=%u",atCIPCLOSE , idx);
			
			while(true){
				
				wf_resulr_t result = recvResponse(1000);
				
				if(result == WFR_OK){
					break;
				}
				else if(result == WFR_CLOSED){
					continue;
				} else {
					//	everything else is an error
					break;
				}
			}
			
			// call any callbacks
			if(_linkCallbacks[idx] != NULL) {
				
				char noIPaddr[16] = {0};
				(_linkCallbacks[idx])(idx, _linkCallbackArgs[idx],
											 WFCF_CLOSED, noIPaddr, 0,  NULL, 0 );
			}
		}
	}

	// zero  out the linkIDs
	bzero(_activeLinks, sizeof(cipStatus_entry) * MAX_WIFI_LINKS );
	bzero(_linkCallbacks,sizeof(connection_func_t) * MAX_WIFI_LINKS );
	bzero(_linkCallbackArgs, sizeof (void*) * MAX_WIFI_LINKS );
	bzero(_udpReplyTimeouts, sizeof(unsigned long) * MAX_WIFI_LINKS );
	bzero(_linksToClose,  sizeof(bool) * MAX_WIFI_LINKS );
	bzero(_newServerConnection,  sizeof(bool) * MAX_WIFI_LINKS );
 
}


int CompareByRSSI(void* arg,  const void *elem1, const void *elem2 )
{
	ap_entry* ap1 = (ap_entry*)elem1;
	ap_entry* ap2 = (ap_entry*)elem2;
 
	return (ap1->rssi < ap2->rssi ? 1 : -1);		// we are sorting for strongest signal
}

bool ESP8266Mgr::getAPList(bool filterBestRSSI,
								ap_entry** outAllocAPlist,  size_t *outCount){
	
	bool success = false;
	
	const size_t apAlloc_quantum = 1;
	ap_entry	*apList = NULL;
	size_t	 apCount = 0;
	size_t	 apAlloc = 0;
	
	STOP_TRACE
	
	writeCommand(atCWLAP);
	
	while(true) {
		
