vinthewrench/Coop2/ESP8266Mgr.cpp
		wf_resulr_t result = recvResponse(3000);
		
		if(result == WFR_CWLAP){
			
			ap_entry  apd;
			
			if(_parser.get_apInfo(&apd)) {
				
				bool found = false;
				
				//			Serial_Printf(&Serial,"SSID: %s |%17s| %d", apd.ssid, apd.mac, apd.rssi);
				
				if(outAllocAPlist){
					
					// create a table if needed
					if(apList == NULL)
					{
						apAlloc = apAlloc_quantum;
						apList = (ap_entry*) malloc(apAlloc * sizeof(ap_entry));
					}
					
					// scan for existing entry
					for(size_t idx = 0; idx < apCount ; idx++){
						ap_entry* entry = &apList[idx];
						
						// never the same MAC (bug in ESP8266 SW)
						if( strncmp(apd.mac, entry->mac, 17) == 0){
							found = true;
							break;
						}
						
						if(filterBestRSSI){
							if( strncmp(apd.ssid, entry->ssid, 32) == 0) {
								found = true;
								if(apd.rssi > entry->rssi){
									*entry = apd;
									break;
								}
							}
						}
					}
					
					if(!found){
						// extend if needed
						if(apCount >= apAlloc)
						{
							apAlloc += apAlloc_quantum;
							apList = (ap_entry*) realloc(apList, apAlloc * sizeof(ap_entry));
						}
						
						apList[apCount] = apd;
					}
					
				}
				if(!found){
					apCount++;
				}
			}
			
		} else if(result == WFR_OK){
			success = true;
			break;
		}
		else {
			break;
		}
	}
	
	if(success){
		
		qsort_r(apList, apCount, sizeof(ap_entry), NULL,  CompareByRSSI);
		
	}
	else {
		if(apList)
			free(apList);
		
		apList = NULL;
		apCount = 0;
	}
	
	
	if(outAllocAPlist)
		*outAllocAPlist = apList;
	
	if(outCount)
		*outCount = apCount;
	
	START_TRACE
	
	
	return success;
}




//  simple do a command
bool ESP8266Mgr::doCmd(const char *fmt, ...){
	
	char buff[128];
	
	va_list args;
	va_start(args, fmt);
	
	vsprintf(buff, fmt, args);
	
#if DEBUG_PROTOCOL
	Serial_Printf(&Serial, "CMD |%s|",buff);
#endif
	_wifiSerial->print(buff);
	_wifiSerial->println();
	
	va_end(args);
	
	while(true){
		wf_resulr_t result = recvResponse(500);
		
		if(result == WFR_OK)
			return true;
		
		if(result == WFR_OTHER)  // ignore noise
			continue;
		
		break;
	}
	
	return false;
}

void ESP8266Mgr::writeCommand(const char *fmt, ...)
{
	char buff[1024];
	
	va_list args;
	va_start(args, fmt);
	
	vsprintf(buff, fmt, args);
	
#if DEBUG_PROTOCOL
	Serial_Printf(&Serial, "CMD |%s|",buff);
#endif
	_wifiSerial->print(buff);
	_wifiSerial->println();
	
	va_end(args);
}

wf_resulr_t ESP8266Mgr::recvResponse(uint32_t timeout){
	
#if DEBUG_STREAM
	uint8_t buffer[1024] ={0};
	size_t  count = 0;
#endif
 
	wf_resulr_t result = WFR_NOTHING;
	 
	unsigned long start = millis();
//	while (millis() - start < timeout)
	
	while(true) {
		while (_wifiSerial->available() > 0 ) {
			
			uint8_t ch = _wifiSerial->read();
			
			result = _parser.process_char(ch);
			
#if DEBUG_STREAM
			
			buffer[count++] = ch;
			if (ch < 32) {
				Serial_Printf(&Serial, "%02x     = %u", ch, result);
			} else {
				Serial_Printf(&Serial, "%02x |%c| = %u", ch, ch, result);
			}
#endif
			
			if(result != WFR_CONTINUE)
				goto done;
		}
		if(timeout == 0
			||( millis() - start > timeout))
			break;
	}
	
	
done:
#if DEBUG_STREAM
	
	if(trace_stream){
		if(count){
			dumpHex(&Serial,buffer,count,0);
		}
		if(result != WFR_NOTHING)
			Serial_Printf(&Serial,"recvResponse %u %s\n", result, responseTable[result]);

	}
#endif
	
	return result;
}


wf_resulr_t ESP8266Mgr::handleResponse(uint32_t timeout,
												bool *statusChangeOut,
												bool *APChangeOut ){
	
	wf_resulr_t result = WFR_INVALID;
	
	bool statusDidChange = false;
	bool APstatusDidChange = false;

	while(true){
		
		result = recvResponse(timeout);
		
		// process more bytes
		if(result == WFR_CONTINUE)
		{
			continue;
		}
		
		// no data
		else if(result == WFR_NOTHING)  // no input?
		{
			break;
		}
		
		// A connection closed.   just mark it for later
		else if(result == WFR_CLOSED){
			// this might be a remote close.
			uint8_t* data = NULL;
	
			if(_parser.get_data( &data, NULL)) {
				
				int linkid = 0;
				if( sscanf((const char *) data, "%d,CLOSED", &linkid) == 1){
		
					if((linkid < MAX_WIFI_LINKS)
						&& (_linkCallbacks[linkid] != NULL)
						&& (_linksToClose[linkid] != true) ) {
					
						// Tell the callback that it is closed.
						char noIPaddr[16] = {0};
						(_linkCallbacks[linkid])(linkid, _linkCallbackArgs[linkid],
														 WFCF_CLOSED, noIPaddr, 0,  NULL, 0 );
						
						_newServerConnection[linkid] 	= false;
						_linkCallbacks[linkid] 			= NULL;
						_linkCallbackArgs[linkid] 		= NULL;
	
					}
				}
				
				free(data);
			}
			
			statusDidChange = true;
			
			continue;
		}
		
		// A connection opened.   just mark it for later
		else if( result == WFR_CONNECT){
			statusDidChange = true;
			break;
		}
		// wifi connected?  just mark it for later
		else if( result == WFR_WIFI_CONNECTED){
			statusDidChange = true;
			APstatusDidChange = true;
			continue;
		}
		// wifi is broken  just mark it for later
		else if( result == WFR_DISCONNECT){
			statusDidChange = true;
			APstatusDidChange = true;
			continue;
		}
		
		// we got input -- proccess it
		else if( result == WFR_IPD){
			ipd_data_t ipd;
			
			if( _parser.get_ipd(&ipd)) {
				// param check
				
				/*
				 In the case of a server.
				 It is possible for the +IPD to come in immediately  after the CONNECT
				 and before we have had a chance to inform the server of a WFCF_OPEN
				 
				 we know this because
				 
				 if((serverCallback != NULL)
				 && (_linkCallbacks[ipd.linkid] == NULL)
				 && (_linksToClose[ipd.linkid] != true))
				 
				 in this case, we need to simulate this and fudge the table.
				 
				 we have the ipd.linkid,  the ipd.ipaddr, and ipd.portNum so we can
				 pass that to a
				 
				 (serverCallback)(linkid, serverCallbackArg,
											 	 WFCF_OPEN,
				 								ipd.ipaddr,
												 ipd.portNum,
											  NULL, 0 );

				 
				 _linkCallbacks[linkid] = serverCallback;
				 _linkCallbackArgs[linkid] = serverCallbackArg;
				 _newServerConnection[linkid] = true;
 
				 Serial_Printf(&Serial,"rcv IPD %u  %u\n", ipd.linkid, ipd.length);

				 */
				  
 
				
#if 1
				if((serverCallback != NULL)
				&& (_linkCallbacks[ipd.linkid] == NULL)
					&& (_linksToClose[ipd.linkid] != true)){
	 
					_linkCallbacks[ipd.linkid] = serverCallback;
					_linkCallbackArgs[ipd.linkid] = serverCallbackArg;
					_newServerConnection[ipd.linkid] = false;
					
					(serverCallback)(ipd.linkid, serverCallbackArg,
													WFCF_OPEN,
												  ipd.ipaddr,
													ipd.portNum,
												 NULL, 0 );

	 
				}
  
				if((ipd.linkid < MAX_WIFI_LINKS)
					&& (_linkCallbacks[ipd.linkid] != NULL)
					&& (_linksToClose[ipd.linkid] != true) ) {
					
					(_linkCallbacks[ipd.linkid])(ipd.linkid,
														  _linkCallbackArgs[ipd.linkid],
														  WFCF_IPD,
														  ipd.ipaddr,
														  ipd.portNum,
														  ipd.data, ipd.length );
				}
				
//				if((serverCallback != NULL)
//				&& (_linkCallbacks[ipd.linkid] == NULL)
//					&& (_linksToClose[ipd.linkid] != true)) {
//
//					(serverCallback)(ipd.linkid,
//										 serverCallbackArg,
//										 WFCF_IPD,
//										 ipd.ipaddr,
//										 ipd.portNum,
//										 ipd.data, ipd.length );
//				}

#else
				if((ipd.linkid < MAX_WIFI_LINKS)
					&& (_linkCallbacks[ipd.linkid] != NULL)
					&& (_linksToClose[ipd.linkid] != true) ) {
					
					(_linkCallbacks[ipd.linkid])(ipd.linkid,
														  _linkCallbackArgs[ipd.linkid],
														  WFCF_IPD,
														  ipd.ipaddr,
														  ipd.portNum,
														  ipd.data, ipd.length );
				}
#endif
				
			}
			continue;
		}
		// anything else just break;
		else {
			break;
		}
	}
	
	if(statusChangeOut)
		*statusChangeOut = statusDidChange;

	if(APChangeOut)
		*APChangeOut = APstatusDidChange;
 
	return result;
	
}
